/* eslint-disable max-len */
import PageWrapper from 'components/common/PageWrapper';
import Layout from 'components/layout/Layout';
import Terms from 'components/pages/terms/Terms';

const termsContent = `제2조 (용어의 정의)
이 약관에서 사용하는 용어의 정의는 아래와 같다.

"사이트"라 함은 회사가 서비스를 "회원"에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 설정한 가상의 영업장 또는 회사가 운영하는 웹사이트, 모바일웹, 앱 등의 서비스를 제공하는 모든 매체를 통칭한다.
"서비스"라 함은 회사가 운영하는 사이트를 통해 개인이 구직 등의 목적으로 등록하는 자료를 DB화하여 각각의 목적에 맞게 분류 가공, 집계하여 정보를 제공하는 서비스와 사이트에서 제공하는 모든 부대 서비스를 말한다.
"회원"이라 함은 "회사"가 제공하는 서비스를 이용하거나 이용하려는 자로 회원가입 절차를 거쳐 회사로부터 회원으로 인정받은 "개인회원"을 말한다.
"아이디"라 함은 회원가입시 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 "회사"가 부여하는 문자와 숫자의 조합 또는 휴대폰 번호를 말한다.
"비밀번호"라 함은 위 제4항에 따라 회원이 회원가입시 아이디를 설정하면서 아이디를 부여받은 자와 동일인임을 확인하고 "회원"의 권익을 보호하기 위하여 "회원"이 선정하거나 회사에서 부여한 문자와 숫자, 또는 문자와 숫자의 조합을 말한다.
"비회원"이라 함은 회원가입절차를 거치지 않고 "회사"가 제공하는 서비스를 이용하거나 하려 는 자를 말한다.

제2조 (용어의 정의)
이 약관에서 사용하는 용어의 정의는 아래와 같다.

"사이트"라 함은 회사가 서비스를 "회원"에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 설정한 가상의 영업장 또는 회사가 운영하는 웹사이트, 모바일웹, 앱 등의 서비스를 제공하는 모든 매체를 통칭한다.
"서비스"라 함은 회사가 운영하는 사이트를 통해 개인이 구직 등의 목적으로 등록하는 자료를 DB화하여 각각의 목적에 맞게 분류 가공, 집계하여 정보를 제공하는 서비스와 사이트에서 제공하는 모든 부대 서비스를 말한다.
"회원"이라 함은 "회사"가 제공하는 서비스를 이용하거나 이용하려는 자로 회원가입 절차를 거쳐 회사로부터 회원으로 인정받은 "개인회원"을 말한다.
"아이디"라 함은 회원가입시 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 "회사"가 부여하는 문자와 숫자의 조합 또는 휴대폰 번호를 말한다.
"비밀번호"라 함은 위 제4항에 따라 회원이 회원가입시 아이디를 설정하면서 아이디를 부여받은 자와 동일인임을 확인하고 "회원"의 권익을 보호하기 위하여 "회원"이 선정하거나 회사에서 부여한 문자와 숫자, 또는 문자와 숫자의 조합을 말한다.
"비회원"이라 함은 회원가입절차를 거치지 않고 "회사"가 제공하는 서비스를 이용하거나 하려 는 자를 말한다.

제2조 (용어의 정의)
이 약관에서 사용하는 용어의 정의는 아래와 같다.

"사이트"라 함은 회사가 서비스를 "회원"에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 설정한 가상의 영업장 또는 회사가 운영하는 웹사이트, 모바일웹, 앱 등의 서비스를 제공하는 모든 매체를 통칭한다.
"서비스"라 함은 회사가 운영하는 사이트를 통해 개인이 구직 등의 목적으로 등록하는 자료를 DB화하여 각각의 목적에 맞게 분류 가공, 집계하여 정보를 제공하는 서비스와 사이트에서 제공하는 모든 부대 서비스를 말한다.
"회원"이라 함은 "회사"가 제공하는 서비스를 이용하거나 이용하려는 자로 회원가입 절차를 거쳐 회사로부터 회원으로 인정받은 "개인회원"을 말한다.
"아이디"라 함은 회원가입시 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 "회사"가 부여하는 문자와 숫자의 조합 또는 휴대폰 번호를 말한다.
"비밀번호"라 함은 위 제4항에 따라 회원이 회원가입시 아이디를 설정하면서 아이디를 부여받은 자와 동일인임을 확인하고 "회원"의 권익을 보호하기 위하여 "회원"이 선정하거나 회사에서 부여한 문자와 숫자, 또는 문자와 숫자의 조합을 말한다.
"비회원"이라 함은 회원가입절차를 거치지 않고 "회사"가 제공하는 서비스를 이용하거나 하려 는 자를 말한다.

제2조 (용어의 정의)
이 약관에서 사용하는 용어의 정의는 아래와 같다.

"사이트"라 함은 회사가 서비스를 "회원"에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 설정한 가상의 영업장 또는 회사가 운영하는 웹사이트, 모바일웹, 앱 등의 서비스를 제공하는 모든 매체를 통칭한다.
"서비스"라 함은 회사가 운영하는 사이트를 통해 개인이 구직 등의 목적으로 등록하는 자료를 DB화하여 각각의 목적에 맞게 분류 가공, 집계하여 정보를 제공하는 서비스와 사이트에서 제공하는 모든 부대 서비스를 말한다.
"회원"이라 함은 "회사"가 제공하는 서비스를 이용하거나 이용하려는 자로 회원가입 절차를 거쳐 회사로부터 회원으로 인정받은 "개인회원"을 말한다.
"아이디"라 함은 회원가입시 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 "회사"가 부여하는 문자와 숫자의 조합 또는 휴대폰 번호를 말한다.
"비밀번호"라 함은 위 제4항에 따라 회원이 회원가입시 아이디를 설정하면서 아이디를 부여받은 자와 동일인임을 확인하고 "회원"의 권익을 보호하기 위하여 "회원"이 선정하거나 회사에서 부여한 문자와 숫자, 또는 문자와 숫자의 조합을 말한다.
"비회원"이라 함은 회원가입절차를 거치지 않고 "회사"가 제공하는 서비스를 이용하거나 하려 는 자를 말한다.`;

const TermsOfUse = () => {
  return (
    <Layout>
      <PageWrapper>
        <Terms title='이용약관' content={termsContent} />
      </PageWrapper>
    </Layout>
  );
};

export default TermsOfUse;
